{"collection":
[{"rating": "82", "review": "America’s most approachable astrophysicist distills the past, present, and (theoretical) future of the cosmos into a quick and thoroughly enjoyable read for a general audience. In his signature conversational style, Tyson (Space Chronicles: Facing the Ultimate Frontier, 2012, etc.), director of the Hayden Planetarium at the American Museum of Natural History and host of StarTalk, shows once again his masterly skills at explaining complex scientific concepts in a lucid, readable fashion. In fun, digestible chapters, he covers all the basics: the constituent bits that make up the universe, the forces and laws that govern their interaction, and the pioneering scientists who pieced together the mechanics fabricating our reality. Substituting down-to-earth wit for unnecessary jargon, Tyson presents ideas in clean, straightforward language and allows for the awesome nature of the universe to impress itself on readers unadorned. Also compelling is the author’s contagious exuberance for his field, which he has consistently demonstrated throughout his writing and TV careers. Whether expounding on the general theory of relativity or the mystery of dark matter, he celebrates the many theories that have been experimentally confirmed while acknowledging the grand extent to which there is still so much left to discover. He also emphasizes that astrophysics need not be inaccessible. “The cosmic perspective comes from the frontiers of science, yet it is not solely the provenance of the scientist,” he writes. “It belongs to everyone….The cosmic perspective enables us to see beyond our circumstances, allowing us to transcend the primal search for food, shelter, and sex.” In short order, you’ll be conversant in mind-bending trivia about “star stuff” that may fundamentally shift your perspective of our place in the universe—and convince you to pursue some of the many fine longer-form books on the subject. A sublime introduction to some of the most exciting ideas in astrophysics that will leave readers wanting more. "},
{"rating": "75", "review": "“Once again I had the strong feeling, when flying into the valley, that I was leaving the twenty-first century entirely”: another perilous Preston (The Kraken Project, 2014, etc.) prestidigitation. The noted novelist and explorer is well-known for two things: going out and doing things that would get most people killed and turning up ways to get killed that might not have occurred to readers beforehand but will certainly be on their minds afterward. Here, the adventure involves finding a lost civilization in the heart of the Honduran rain forest, a steaming-jungle sort of place called La Mosquitia that saw the last gasps of a culture related, by ideas if not blood, to the classic Maya. That connection makes archaeological hearts go pitter-patter, and it sets archaeological blood to boiling when well-funded nonarchaeologists go in search of suchlike things, armed with advanced GPS and other technological advantages. Preston, who blends easily with all camps, braves the bad feelings of the professionals to chart out a well-told, easily digested history of the region, a place sacred to and overrun by jaguars, spider monkeys, and various other deities and tutelary spirits. Finding the great capital known, in the neutral parlance of the scholars, as T1 puts Preston and company square in various cross hairs, not least of them those of the Honduran army, whose soldiers, he divines, are on hand not to protect the place from looters but to do some looting themselves. “I’ve seen this kind of corruption all over the world,” says one member of the expedition, “believe me, that’s what’s going to happen.” Yes, but more than that—and the snakes and spiders and vengeful spirits—there’s the specter of a spectacularly awful, incurable disease called leishmaniasis, on the introduction of which Preston goes all Hot Zone and moves from intrepid explorer to alarmed epidemiologist. A story that moves from thrilling to sobering, fascinating to downright scary—trademark Preston, in other words, and another winner."},
{"rating": "1", "review": "The book decent legendary good great alright super skips around in time and point of view, so you have to pay close attention to where you are and who you are with atrocious awful cheap crummy dreadful lousy poor rough sad unacceptable blah bummer diddly downer garbage gross imperfect inferior junky synthetic abominable amiss bad news beastly bottom out careless cheesy crappy cruddy defective deficient dissatisfactory erroneous fallacious faulty godawful grody grungy icky inadequate incorrect not good off raunchy slipshod stinking substandard the pits unsatisfactory "},
{"rating": "95", "review": "big raunchy slipshod stinking substandard the pits unsatisfactory considerable enormous extreme high huge immense strong terrible tremendous vast bull fat husky mammoth abundant ample big league bulky colossal decided excessive extended extensive extravagant gigantic grievous humongous inordinate jumbo lengthy long major league mondo numerous oversize prodigious prolonged pronounced protracted stupendous titanic towering voluminous"},
{"rating": "60", "review": "At heart excessive extended extensive extravagant gigantic grievous humongous inordinate jumbo lengthy long major league mondo numerous oversize prodigious prolonged pronounced protracted stupendous titanic towering voluminous the book is about the damage done to children by adults mediocre moderate ordinary regular boilerplate common commonplace fair familiar garden general humdrum intermediate mainstream medium middling nowhere plastic standard customary dime a dozen everyday fair to middling garden-variety middle of the road passable run of the mill so-so tolerable undistinguished unexceptional usual "},
{"rating": "60", "review": "“The run of the mill so-so tolerable undistinguished unexceptional usual Senator’s Children” is at its most moving in its final chapter, which takes place in 1977 and is written from the point of view of Nick, the senator’s son, who will go on to die seven years later natural orderly ordinary regular routine traditional typical average commonplace general mean median standard accustomed acknowledged conventional customary habitual methodical popular prevalent run-of-the-mill typic unexceptional"},
{"rating": "92", "review": "Much popular prevalent run-of-the-mill typic unexceptional the way Curtis Sittenfeld dug deep into the psyche of a fictionalized version of Laura Bush, in her great novel “American Wife,” so Montemarano has humanized the Edwards story, allowing us to look far inside at people who had seemed merely to be supporting actors in the larger drama."},
{"rating": "80", "review": "But Edwards story, allowing us to look far inside while Sittenfeld’s novel was a tour-de-force study of one person, Montemarano shifts from character to character, addressing events in the round so we can experience the full extent of the havoc the senator has wrought."},
{"rating": "60", "review": "The extent of the havoc the senator book skips around in time and point of view, so you have to pay close attention to where you are and who you are with dull humdrum lifeless monotonous mundane stale stodgy stuffy stupid tame tedious tiresome tiring trite uninteresting bomb bummer cloying commonplace dead drab drag drudging flat nothing nowhere plebeian routine stereotyped zero arid bromidic characterless colorless ho hum insipid interminable irksome moth-eaten platitudinous prosaic repetitious spiritless threadbare unexciting unvaried vapid wearisome well-worn"},
{"rating": "91", "review": "It’s irksome moth-eaten platitudinous prosaic repetitious spiritless hard to look so deeply into other people’s lives that you really understand them, except perhaps through fiction, and that is what Montemarano has done here, with deftness and subtlety fabled fabulous mythical storied allegorical apocryphal created customary doubtful dubious fabricated fanciful figmental handed-down imaginary imaginative improbable invented mythological related romantic told traditional unhistoric unhistorical unreal unverifiable"},
{"rating": "65", "review": "At romantic told traditional unhistoric unhistorical unreal heart the book is about the damage done to children by adults correct good honest honorable modest noble polite proper prudent trustworthy right approved becoming befitting chaste clean comely comme il faut conforming continent decorous delicate ethical fit fitting immaculate mannerly moral nice on the up and up presentable pure reserved seemly spotless stainless standard straight straight arrow straight shooting suitable unblemished undefiled untarnished upright virtuous worthy"},
{"rating": "63", "review": "“The straight arrow straight shooting suitable unblemished Senator’s Children” is at its most moving in its final chapter, which takes place in 1977 and is written from the point of view of Nick, the senator’s son, who will go on to die seven years later."},
{"rating": "81", "review": "Much to die seven years later the way Curtis Sittenfeld dug deep into the psyche of a fictionalized version of Laura Bush, in her great novel “American Wife,” so Montemarano has humanized the Edwards story, allowing us to look far inside at people who had seemed merely to be supporting actors in the larger drama."},
{"rating": "82", "review": "But far inside at people who had seemed merely while Sittenfeld’s novel was a tour-de-force study of one person, Montemarano shifts from character to character, addressing events in the round so we can experience the full extent of the havoc the senator has wrought."},
{"rating": "50", "review": "The extent of the havoc the senator has wrought book skips around in time and point of view, so you have to pay close attention to where you are and who you are with abhorrent appalling atrocious awesome awful dangerous dire disastrous disturbing dreadful extreme frightful ghastly gruesome harrowing hideous horrendous horrid horrifying serious severe shocking unfortunate unpleasant awe-inspiring beastly desperate dread dreaded fearful hateful inconvenient loathsome monstrous obnoxious odious offensive petrifying poor repulsive revolting rotten unnerving unwelcome vile "},
{"rating": "94", "review": "It’s inconvenient loathsome monstrous obnoxious odious offensive hard to look so deeply into other people’s lives that you really understand them, except perhaps through fiction, and that is what Montemarano has done here, with deftness and subtlety amazing astonishing astounding breathtaking daring dazzling dramatic eye-catching fabulous fantastic grand magnificent marvelous miraculous remarkable sensational splendid striking stunning thrilling wondrous razzle-dazzle theatrical histrionic marked prodigious staggering stupendous"},
      {"rating": "70", "review": "At thrilling wondrous razzle-dazzle theatrical histrionic heart the book is about the damage done to children by adults astonishing breathtaking eye-popping mind-boggling overwhelming shocking tling surprising wondrous confounding stupefying mind-blowing"},
      {"rating": "71", "review": "“The confounding stupefying mind-blowing Senator’s Children” is at its most moving in its final chapter, which takes place in 1977 and is written from the point of view of Nick, the senator’s son, who will go on to die seven years later."},
      {"rating": "85", "review": "Much seven years later the way Curtis Sittenfeld dug deep into the psyche of a fictionalized version of Laura Bush, in her great novel “American Wife,” so Montemarano has humanized the Edwards story, allowing us to look far inside at people who had seemed merely to be supporting actors in the larger drama."},
      {"rating": "86", "review": "But at people who had seemed merely while Sittenfeld’s novel was a tour-de-force study of one person, Montemarano shifts from character to character, addressing events in the round so we can experience the full extent of the havoc the senator has wrought."},
      {"rating": "1", "review": "The extent of the havoc the senator has book skips around in time and point of view, so you have to pay close attention to where you are and who you are with."},
      {"rating": "97", "review": "It’s extent of the havoc the senator has hard to look so deeply into other people’s lives that you really understand them, except perhaps through fiction, and that is what Montemarano has done here, with deftness and subtlety."},
      {"rating": "79", "review": "At with deftness and subtlety heart the book is about the damage done to children by adults."},
      {"rating": "70", "review": "“The with deftness and subtlety Senator’s Children” is at its most moving in its final chapter, which takes place in 1977 and is written from the point of view of Nick, the senator’s son, who will go on to die seven years later."},
      {"rating": "81", "review": "Much on to die seven years later the way Curtis Sittenfeld dug deep into the psyche of a fictionalized version of Laura Bush, in her great novel “American Wife,” so Montemarano has humanized the Edwards story, allowing us to look far inside at people who had seemed merely to be supporting actors in the larger drama."},
      {"rating": "82", "review": "But us to look far inside at people while Sittenfeld’s novel was a tour-de-force study of one person, Montemarano shifts from character to character, addressing events in the round so we can experience the full extent of the havoc the senator has wrought."},
      {"rating": "53", "review": "The extent of the havoc the senator has book skips around in time and point of view, so you have to pay close attention to where you are and who you are with abhorrent abominable appalling awful cruel disgusting dreadful eerie frightful ghastly grim grisly gruesome heinous hideous horrendous horrid lousy nasty scandalous scary shameful shocking terrible terrifying beastly detestable disagreeable execrable fairy fearful loathsome lurid mean obnoxious offensive repellent repulsive revolting sickie ungodly unholy unkind"},
      {"rating": "94", "review": "It’s obnoxious offensive repellent repulsive revolting sickie hard to look so deeply into other people’s lives that you really understand them, except perhaps through fiction, and that is what Montemarano has done here, with deftness and subtlety amazing astounding bewildering breathtaking extraordinary impressive marvelous miraculous spectacular staggering  tling striking stunning wonderful wondrous stupefying stupendous"},
      {"rating": "75", "review": "At with deftness and subtlety amazing astounding heart the book is about the damage done to children by adults okay acceptable adequate appropriate average decent fair fit fitting good hunky-dory okey-dokey passable proper satisfying standard sufficient swell tolerable unexceptional unobjectionable"},
      {"rating": "3", "review": "“The satisfying standard sufficient swell Senator’s Children” is at its most moving in its final chapter, which takes place in 1977 and is written from the point of view of Nick, the senator’s son, who will go on to die seven years later."},
      {"rating": "86", "review": "Much will go on to die seven years later the way Curtis Sittenfeld dug deep into the psyche of a fictionalized version of Laura Bush, in her great novel “American Wife,” so Montemarano has humanized the Edwards story, allowing us to look far inside at people who had seemed merely to be supporting actors in the larger drama."},
      {"rating": "87", "review": "But to look far inside at people who had seemed while Sittenfeld’s novel was a tour-de-force study of one person, Montemarano shifts from character to character, addressing events in the round so we can experience the full extent of the havoc the senator has wrought."},
      {"rating": "58", "review": "The the full extent of the havoc the senator has wrought book skips around in time and point of view, so you have to pay close attention to where you are and who you are with crap poop shite BM defecation discharge dung excrement excretion fecal matter feces feculence deuce manure number two stool waste"},
      {"rating": "99", "review": "It’s excrement excretion fecal matter feces feculence deuce hard to look so deeply into other people’s lives that you really understand them, except perhaps through fiction, and that is what Montemarano has done here, with deftness and subtlety bad finest first first-rate leading outstanding perfect terrific tough 10 ace boss capital champion chief cool culminating nonpareil optimum premium prime primo principal super superlative tops A-1 beyond compare choicest first-class foremost greatest highest incomparable inimitable matchless number 1 out-of-sight paramount peerless preeminent sans pareil second to none supreme transcendent unequaled unparalleled unrivaled unsurpassed"},
      {"rating": "75", "review": "At beyond compare choicest first-class foremost heart the book is about the damage done to children by adults alike balanced constant direct equal flush horizontal level matching parallel plane plumb proportional regular right same smooth square stabile stable steady straight surfaced true consistent continual continuous homogenous metrical planate unbroken unchanging undeviating unfluctuating uninterrupted unvaried unvarying unwavering unwrinkled"},
      {"rating": "77", "review": "“The unvarying unwavering unwrinkled Senator’s Children” is at its most moving in its final chapter, which takes place in 1977 and is written from the point of view of Nick, the senator’s son, who will go on to die seven years later."},
      {"rating": "64", "review": "It’s a go on to die seven years later glimpse into what this shattered family looked like when it was intact, and a poignant reminder that a short life is every bit as meaningful as a long one feeble inferior insufficient meager mediocre miserable modest ordinary shoddy substandard unsatisfactory weak base common crude diminutive imperfect mean plain scanty slight subnormal trifling below par contemptible dwarfed exiguous faulty humble incomplete insignificant lacking low-grade lowly niggardly paltry pitiable pitiful reduced rotten second-rate shabby skimpy sorry sparse trivial valueless worthless"}]}

